# YOLOv12 🚀, AGPL-3.0 license
# YOLOv12 object detection model with P3-P5 outputs. For usage examples see https://docs.ultralytics.com/tasks/detect

# Model: GCF + SSFM + DGRM

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# YOLO12n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]                  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]                 # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]          # 2
  - [-1, 1, Conv, [256, 3, 2]]                 # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]          # 4
  - [-1, 1, Conv, [512, 3, 2]]                 # 5-P4/16
  - [-1, 4, GCF, [512, True, 4]]               # 6
  - [-1, 1, Conv, [1024, 3, 2]]                # 7-P5/32
  - [-1, 4, GCF, [1024, True, 1]]              # 8

# YOLO12n head (without Zoom_cat)
head:
  - [-1, 1, Conv, [512, 1, 1]]                  # 9  reduce P5
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]]                  # 11 concat backbone P4
  - [-1, 3, GCF, [512, False, -1]]             # 12

  - [-1, 1, Conv, [256, 1, 1]]                  # 13 reduce P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 14
  - [[-1, 4], 1, Concat, [1]]                  # 15 concat backbone P3
  - [-1, 3, GCF, [256, False, -1]]             # 16 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]                 # 17 downsample
  - [[-1, 12], 1, Concat, [1]]                 # 18 concat head P4
  - [-1, 3, GCF, [512, False, -1]]             # 19 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 2]]                 # 20 downsample
  - [[-1, 9], 1, Concat, [1]]                  # 21 concat head P5
  - [-1, 3, C3k2, [1024]]                      # 22 (P5/32-large)

  - [[4, 6, 8], 1, SSFM, [256]]                # 23 scale-sequence feature fusion
  - [[16, -1], 1, DGRM, [256]]                 # 24 detail-guided refinement

  - [[24, 19, 22], 1, Detect, [nc]]            # 25 Detect(P3, P4, P5)
